import React from 'react';
import SocialProfile from '../../../molecules/social-profile/socialProfile';

import {
    IntroWrapper,
    IntroImage,
    IntroTitle,
    Desciption,
    IntroInfo,
} from './style';
import {
    IoLogoFacebook,
    IoLogoTwitter,
    IoLogoInstagram,
    IoLogoGithub,
} from 'react-icons/io';

const SocialLinks = [
    {
        icon: <IoLogoFacebook />,
        url: '#',
        tooltip: 'Facebook',
    },
    {
        icon: <IoLogoInstagram />,
        url: '#',
        tooltip: 'Instagram',
    },
    {
        icon: <IoLogoTwitter />,
        url: '#',
        tooltip: 'Twitter',
    },
    {
        icon: <IoLogoGithub />,
        url: '#',
        tooltip: 'Github',
    },
];

const Intro = () => {
    const author = "ZZM";
    const about = "하였으며, 꾸며 그들은 현저하게 그들을 것이다. 보배를 찾아다녀도, 이 영락과 것이다. 그러므로 되는 행복스럽고 이상의 때에, 때까지 뼈 보는 것이다. 속에 투명하되 남는 노년에게서 밝은 광야에서 교향악이다. 목숨을 우리의 충분히 말이다. 그들의 얼마나 얼마나 대중을 위하여, 살 끓는다. 황금시대를 불어 풀이 바이며, 아름다우냐?하였으며, 꾸며 그들은 현저하게 그들을 것이다. 보배를 찾아다녀도, 이 영락과 것이다. 그러므로 되는 행복스럽고 이상의 때에, 때까지 뼈 보는 것이다. 속에 투명하되 남는 노년에게서 밝은 광야에서 교향악이다. 목숨을 우리의 충분히 말이다. 그들의 얼마나 얼마나 대중을 위하여, 살 끓는다. 황금시대를 불어 풀이 바이며, 아름다우냐?하였으며, 꾸며 그들은 현저하게 그들을 것이다. 보배를 찾아다녀도, 이 영락과 것이다. 그러므로 되는 행복스럽고 이상의 때에, 때까지 뼈 보는 것이다. 속에 투명하되 남는 노년에게서 밝은 광야에서 교향악이다. 목숨을 우리의 충분히 말이다. 그들의 얼마나 얼마나 대중을 위하여, 살 끓는다. 황금시대를 불어 풀이 바이며, 아름다우냐?하였으며, 꾸며 그들은 현저하게 그들을 것이다. 보배를 찾아다녀도, 이 영락과 것이다. 그러므로 되는 행복스럽고 이상의 때에, 때까지 뼈 보는 것이다. 속에 투명하되 남는 노년에게서 밝은 광야에서 교향악이다. 목숨을 우리의 충분히 말이다. 그들의 얼마나 얼마나 대중을 위하여, 살 끓는다. 황금시대를 불어 풀이 바이며, 아름다우냐?하였으며, 꾸며 그들은 현저하게 그들을 것이다. 보배를 찾아다녀도, 이 영락과 것이다. 그러므로 되는 행복스럽고 이상의 때에, 때까지 뼈 보는 것이다. 속에 투명하되 남는 노년에게서 밝은 광야에서 교향악이다. 목숨을 우리의 충분히 말이다. 그들의 얼마나 얼마나 대중을 위하여, 살 끓는다. 황금시대를 불어 풀이 바이며, 아름다우냐?하였으며, 꾸며 그들은 현저하게 그들을 것이다. 보배를 찾아다녀도, 이 영락과 것이다. 그러므로 되는 행복스럽고 이상의 때에, 때까지 뼈 보는 것이다. 속에 투명하되 남는 노년에게서 밝은 광야에서 교향악이다. 목숨을 우리의 충분히 말이다. 그들의 얼마나 얼마나 대중을 위하여, 살 끓는다. 황금시대를 불어 풀이 바이며, 아름다우냐?하였으며, 꾸며 그들은 현저하게 그들을 것이다. 보배를 찾아다녀도, 이 영락과 것이다. 그러므로 되는 행복스럽고 이상의 때에, 때까지 뼈 보는 것이다. 속에 투명하되 남는 노년에게서 밝은 광야에서 교향악이다. 목숨을 우리의 충분히 말이다. 그들의 얼마나 얼마나 대중을 위하여, 살 끓는다. 황금시대를 불어 풀이 바이며, 아름다우냐?하였으며, 꾸며 그들은 현저하게 그들을 것이다. 보배를 찾아다녀도, 이 영락과 것이다. 그러므로 되는 행복스럽고 이상의 때에, 때까지 뼈 보는 것이다. 속에 투명하되 남는 노년에게서 밝은 광야에서 교향악이다. 목숨을 우리의 충분히 말이다. 그들의 얼마나 얼마나 대중을 위하여, 살 끓는다. 황금시대를 불어 풀이 바이며, 아름다우냐?하였으며, 꾸며 그들은 현저하게 그들을 것이다. 보배를 찾아다녀도, 이 영락과 것이다. 그러므로 되는 행복스럽고 이상의 때에, 때까지 뼈 보는 것이다. 속에 투명하되 남는 노년에게서 밝은 광야에서 교향악이다. 목숨을 우리의 충분히 말이다. 그들의 얼마나 얼마나 대중을 위하여, 살 끓는다. 황금시대를 불어 풀이 바이며, 아름다우냐?";

    return (
        <IntroWrapper>
            <IntroImage>

            </IntroImage>
            <IntroInfo>
                <IntroTitle>
                    Hey! I’m <b>{author}</b>
                </IntroTitle>
                <Desciption>{about}</Desciption>
                <SocialProfile items={SocialLinks} />
            </IntroInfo>
        </IntroWrapper>
    );
};

export default Intro;